-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: qr_chats
-- ------------------------------------------------------
-- Server version	8.0.35

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `messages`
--

DROP TABLE IF EXISTS `messages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `messages` (
  `id` int NOT NULL,
  `chat_id` int DEFAULT NULL,
  `uid` text,
  `message` longtext,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `messages`
--

LOCK TABLES `messages` WRITE;
/*!40000 ALTER TABLE `messages` DISABLE KEYS */;
INSERT INTO `messages` VALUES (0,0,'0','0','2024-04-30 15:28:33'),(1,23,'66350003881daa6b3018dec8','тьб','2024-05-29 21:12:55'),(2,23,'66350049881daa6b3018ded3','пуме','2024-05-29 21:13:07'),(3,23,'66350003881daa6b3018dec8','мапирто','2024-05-29 21:13:25'),(4,24,'66350049881daa6b3018ded3','котову','2024-05-29 21:13:40'),(5,25,'66350049881daa6b3018ded3','мыше','2024-05-29 21:14:07'),(6,26,'66350049881daa6b3018ded3','кошкину','2024-05-29 21:15:30'),(7,13,'663546b0a70a317887e8f79e','кошкин на пуму','2024-05-29 21:15:50'),(8,28,'66350003881daa6b3018dec8','пролдж','2024-05-29 21:16:06'),(9,26,'663546b0a70a317887e8f79e','кошкин на толстова','2024-05-29 21:16:09'),(10,24,'663a90ff75ec295bc9a646d8','котоф на толстова','2024-05-29 21:16:37'),(11,23,'66350003881daa6b3018dec8','митьб','2024-05-29 21:16:51'),(12,29,'663a90ff75ec295bc9a646d8','котофф на пуму','2024-05-29 21:16:57'),(13,29,'66350003881daa6b3018dec8','пума на котоф','2024-05-29 21:17:07'),(14,28,'66350003881daa6b3018dec8','пума на мауса','2024-05-29 21:17:21'),(15,16,'663a8d2875ec295bc9a6463e','маус на толстова','2024-05-29 21:17:32'),(16,28,'663a8d2875ec295bc9a6463e','маус на пуму','2024-05-29 21:17:43'),(17,23,'66350003881daa6b3018dec8','пума на толстого ','2024-05-29 21:18:38'),(18,28,'66350003881daa6b3018dec8','ролд','2024-05-29 21:20:26'),(19,24,'66350049881daa6b3018ded3','принял','2024-05-29 21:35:13'),(20,26,'663546b0a70a317887e8f79e','кошкин на толстова2','2024-05-29 21:57:42'),(21,30,'663546b0a70a317887e8f79e','кошкин на пуму2','2024-05-29 21:58:05'),(22,25,'66350049881daa6b3018ded3','ппивет','2024-05-30 09:21:50'),(23,25,'663a8d2875ec295bc9a6463e','ого, чаты','2024-05-30 09:27:14'),(24,30,'663546b0a70a317887e8f79e','проверка кошкин на пуму','2024-05-30 10:08:48'),(25,25,'66350049881daa6b3018ded3','работают? ','2024-05-30 15:28:23'),(26,25,'663a8d2875ec295bc9a6463e','да','2024-05-30 15:29:57'),(27,25,'663a8d2875ec295bc9a6463e','при обновлении странно программа себя ведет при первом включении','2024-05-30 15:31:07'),(28,25,'66350049881daa6b3018ded3','а сообщение на самый последний тикет? ','2024-05-30 15:31:09'),(29,25,'663a8d2875ec295bc9a6463e','не вижу сообщений на тикете','2024-05-30 15:31:37'),(30,25,'66350049881daa6b3018ded3','есть странность. но я туда не полезу сейчас','2024-05-30 15:31:58'),(31,31,'663a8d2875ec295bc9a6463e','привет, котофф','2024-05-30 15:42:56'),(32,31,'663a90ff75ec295bc9a646d8','привет,мышь','2024-05-30 15:43:47'),(33,32,'663a8d2875ec295bc9a6463e','хохохо','2024-05-30 15:44:47'),(34,32,'663546b0a70a317887e8f79e','даров ','2024-05-30 15:45:28'),(35,31,'663a8d2875ec295bc9a6463e','прпрпрпр','2024-05-30 17:06:19'),(36,23,'66350049881daa6b3018ded3','это длинное придлиннное сообщение о том, что они вылезают за границу окна. надо бы поправить, а то не красиво! ','2024-06-03 23:04:21'),(37,26,'66350049881daa6b3018ded3','толстовка кошкину','2024-06-03 23:24:07'),(38,23,'66350049881daa6b3018ded3','не отваливаются больше? ','2024-06-04 23:06:59'),(39,23,'66350003881daa6b3018dec8','да нет вроде ','2024-06-04 23:11:46'),(40,23,'66350003881daa6b3018dec8','привет','2024-06-05 20:45:23'),(41,23,'66350003881daa6b3018dec8','привет Андрей','2024-06-05 20:52:58'),(42,23,'66350003881daa6b3018dec8','хай','2024-06-05 20:54:13'),(43,23,'66350003881daa6b3018dec8','хай','2024-06-05 20:54:55'),(44,23,'66350003881daa6b3018dec8','вовово','2024-06-05 20:56:31'),(45,23,'66350003881daa6b3018dec8','шщышвышвышщшш','2024-06-05 20:57:24'),(46,23,'66350003881daa6b3018dec8','вввлвл','2024-06-05 20:58:15'),(47,23,'66350003881daa6b3018dec8','ллллллл','2024-06-05 20:59:05'),(48,23,'66350003881daa6b3018dec8','чё реально работает?','2024-06-05 21:00:32'),(49,23,'66350003881daa6b3018dec8','Hi','2024-06-05 21:32:42'),(50,31,'663a8d2875ec295bc9a6463e','едрит мадрид','2024-06-09 16:27:46'),(51,31,'663a90ff75ec295bc9a646d8','хелло','2024-06-09 16:28:14'),(52,31,'663a8d2875ec295bc9a6463e','ррррр','2024-06-10 10:23:59'),(53,31,'663a8d2875ec295bc9a6463e','папим','2024-06-10 10:24:17'),(54,32,'663a8d2875ec295bc9a6463e','жопушка','2024-06-12 19:24:55'),(55,28,'663a8d2875ec295bc9a6463e','из рейтинг листа','2024-06-12 19:26:08'),(56,33,'663a90ff75ec295bc9a646d8','привет','2024-06-12 19:36:34'),(57,23,'66350049881daa6b3018ded3','работает','2024-06-12 22:15:15'),(58,26,'66350049881daa6b3018ded3','работают чаты? ','2024-06-12 22:16:49'),(59,24,'66350049881daa6b3018ded3','работают чаты? ','2024-06-12 22:17:13'),(60,28,'663a8d2875ec295bc9a6463e','чаты','2024-06-13 08:42:39'),(61,31,'663a8d2875ec295bc9a6463e','еще чаты','2024-06-13 08:42:46'),(62,31,'663a8d2875ec295bc9a6463e','тест','2024-06-13 10:41:55'),(63,31,'663a90ff75ec295bc9a646d8','привет,звони на номер','2024-06-13 10:49:25'),(64,31,'663a8d2875ec295bc9a6463e','вот мой телефон, созвонимся','2024-06-13 12:36:35'),(65,25,'663a8d2875ec295bc9a6463e','привте','2024-06-13 12:42:41'),(66,25,'663a8d2875ec295bc9a6463e','чатик проверка','2024-06-15 17:19:16'),(67,25,'66350049881daa6b3018ded3','более насущных трблоадофига, мне кажется','2024-06-15 17:21:40'),(68,25,'663a8d2875ec295bc9a6463e','ок, согласен','2024-06-15 17:21:53'),(69,25,'663a8d2875ec295bc9a6463e','есть заход в чаты через профайл друга','2024-06-15 17:22:24'),(70,25,'663a8d2875ec295bc9a6463e','ок','2024-06-15 17:22:26'),(71,31,'663a90ff75ec295bc9a646d8','жопа','2024-06-16 12:43:56'),(72,24,'663a90ff75ec295bc9a646d8','bbbbb','2024-06-16 12:51:27'),(73,24,'66350049881daa6b3018ded3','gggg','2024-06-16 12:52:03'),(74,33,'663a90ff75ec295bc9a646d8','gggg','2024-06-17 17:10:15'),(75,29,'66350003881daa6b3018dec8','швшваш','2024-06-19 16:05:46'),(76,30,'663546b0a70a317887e8f79e','рррр','2024-06-19 17:25:33'),(77,31,'663a90ff75ec295bc9a646d8','пррроиттттт рроорммии рориирролллмии','2024-06-20 19:52:06'),(78,29,'663a90ff75ec295bc9a646d8','ggggg','2024-07-03 14:03:56'),(79,34,'668c78f1affc44dcf72cc713','пав','2024-07-08 23:41:15'),(80,34,'66350049881daa6b3018ded3','ллл','2024-07-08 23:55:20'),(81,24,'66350049881daa6b3018ded3','jjj','2024-07-09 00:06:51'),(82,34,'66350049881daa6b3018ded3','kkk','2024-07-09 00:07:48'),(83,34,'66350049881daa6b3018ded3','kk','2024-07-09 00:08:08'),(84,24,'66350049881daa6b3018ded3','ллл','2024-07-09 00:17:56'),(88,32,'663a8d2875ec295bc9a6463e','ll','2024-07-09 00:56:29'),(89,44,'663a8d2875ec295bc9a6463e','ааа','2024-07-09 01:07:28'),(90,36,'66350049881daa6b3018ded3','fff','2024-07-09 01:36:26'),(91,44,'66350049881daa6b3018ded3','ffff','2024-07-09 01:37:49'),(92,36,'66350049881daa6b3018ded3','lkuyrtew','2024-07-09 01:42:11'),(93,36,'66350049881daa6b3018ded3','прои','2024-07-09 05:09:24'),(94,44,'66350049881daa6b3018ded3','поли','2024-07-09 05:09:41'),(95,44,'663a8d2875ec295bc9a6463e','привет','2024-07-09 07:04:16'),(96,47,'663a8d2875ec295bc9a6463e','ррррр','2024-07-09 07:23:39'),(97,47,'663a8d2875ec295bc9a6463e','bbbbb','2024-07-09 07:30:30'),(98,31,'663a8d2875ec295bc9a6463e','а так?','2024-07-09 07:31:33'),(99,31,'663a90ff75ec295bc9a646d8','ghjhg','2024-07-16 07:39:47'),(100,47,'663a8d2875ec295bc9a6463e','рюордгпщнсшпс','2024-07-16 07:40:01'),(101,24,'66350049881daa6b3018ded3','л','2024-07-16 09:45:07'),(102,59,'6644ab73d43ce8386de63a70','huio','2024-07-19 00:32:52'),(103,59,'6644ab73d43ce8386de63a70','bgfd','2024-07-19 00:34:08'),(104,59,'6644ab73d43ce8386de63a70','k','2024-07-19 00:35:21'),(105,59,'6644ab73d43ce8386de63a70','ll','2024-07-19 01:20:47'),(106,63,'6695aca6e880c38a1f0a12df','хай','2024-07-19 11:38:30'),(107,62,'6695aca6e880c38a1f0a12df','hi','2024-07-19 11:39:27'),(108,63,'66350049881daa6b3018ded3','и тебе с кисточкой!','2024-07-19 23:58:12');
/*!40000 ALTER TABLE `messages` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-07-20 17:25:46
